// Base Addres of EADC = 0x40043000

#define M2L31_EADC_EADC_DAT0_RESET_VALUE 0x00000000
typedef struct {
    unsigned long RESULT : 16;
    unsigned long OV : 1;
    unsigned long VALID : 1;
    unsigned long Res0 : 14;
} sM2L31_EADC_EADC_DAT0;

typedef union {
    sM2L31_EADC_EADC_DAT0 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_DAT0;

#define M2L31_EADC_EADC_DAT1_RESET_VALUE 0x00000000
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_DAT1;

typedef union {
    sM2L31_EADC_EADC_DAT1 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_DAT1;

#define M2L31_EADC_EADC_DAT2_RESET_VALUE 0x00000000
typedef struct {
    unsigned long RESULT : 16;
    unsigned long OV : 1;
    unsigned long VALID : 1;
    unsigned long Res0 : 14;
} sM2L31_EADC_EADC_DAT2;

typedef union {
    sM2L31_EADC_EADC_DAT2 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_DAT2;

#define M2L31_EADC_EADC_DAT3_RESET_VALUE 0x00000000
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_DAT3;

typedef union {
    sM2L31_EADC_EADC_DAT3 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_DAT3;

#define M2L31_EADC_EADC_DAT4_RESET_VALUE 0x00000000
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_DAT4;

typedef union {
    sM2L31_EADC_EADC_DAT4 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_DAT4;

#define M2L31_EADC_EADC_DAT5_RESET_VALUE 0x00000000
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_DAT5;

typedef union {
    sM2L31_EADC_EADC_DAT5 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_DAT5;

#define M2L31_EADC_EADC_DAT6_RESET_VALUE 0x00000000
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_DAT6;

typedef union {
    sM2L31_EADC_EADC_DAT6 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_DAT6;

#define M2L31_EADC_EADC_DAT7_RESET_VALUE 0x00000000
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_DAT7;

typedef union {
    sM2L31_EADC_EADC_DAT7 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_DAT7;

#define M2L31_EADC_EADC_DAT8_RESET_VALUE 0x00000000
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_DAT8;

typedef union {
    sM2L31_EADC_EADC_DAT8 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_DAT8;

#define M2L31_EADC_EADC_DAT9_RESET_VALUE 0x00000000
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_DAT9;

typedef union {
    sM2L31_EADC_EADC_DAT9 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_DAT9;

#define M2L31_EADC_EADC_DAT10_RESET_VALUE 0x00000000
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_DAT10;

typedef union {
    sM2L31_EADC_EADC_DAT10 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_DAT10;

#define M2L31_EADC_EADC_DAT11_RESET_VALUE 0x00000000
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_DAT11;

typedef union {
    sM2L31_EADC_EADC_DAT11 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_DAT11;

#define M2L31_EADC_EADC_DAT12_RESET_VALUE 0x00000000
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_DAT12;

typedef union {
    sM2L31_EADC_EADC_DAT12 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_DAT12;

#define M2L31_EADC_EADC_DAT13_RESET_VALUE 0x00000000
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_DAT13;

typedef union {
    sM2L31_EADC_EADC_DAT13 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_DAT13;

#define M2L31_EADC_EADC_DAT14_RESET_VALUE 0x00000000
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_DAT14;

typedef union {
    sM2L31_EADC_EADC_DAT14 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_DAT14;

#define M2L31_EADC_EADC_DAT15_RESET_VALUE 0x00000000
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_DAT15;

typedef union {
    sM2L31_EADC_EADC_DAT15 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_DAT15;

#define M2L31_EADC_EADC_DAT16_RESET_VALUE 0x00000000
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_DAT16;

typedef union {
    sM2L31_EADC_EADC_DAT16 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_DAT16;

#define M2L31_EADC_EADC_DAT17_RESET_VALUE 0x00000000
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_DAT17;

typedef union {
    sM2L31_EADC_EADC_DAT17 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_DAT17;

#define M2L31_EADC_EADC_DAT18_RESET_VALUE 0x00000000
typedef struct {
    unsigned long RESULT : 16;
    unsigned long OV : 1;
    unsigned long VALID : 1;
    unsigned long Res0 : 14;
} sM2L31_EADC_EADC_DAT18;

typedef union {
    sM2L31_EADC_EADC_DAT18 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_DAT18;

#define M2L31_EADC_EADC_CURDAT_RESET_VALUE 0x00000000
typedef struct {
    unsigned long CURDAT : 31;
    unsigned long Res0 : 1;
} sM2L31_EADC_EADC_CURDAT;

typedef union {
    sM2L31_EADC_EADC_CURDAT Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_CURDAT;

#define M2L31_EADC_EADC_CTL_RESET_VALUE 0x00000000
typedef struct {
    unsigned long ADCEN : 1;
    unsigned long ADCRST : 1;
    unsigned long ADCIEN0 : 1;
    unsigned long ADCIEN1 : 1;
    unsigned long ADCIEN2 : 1;
    unsigned long ADCIEN3 : 1;
    unsigned long Res0 : 2;
    unsigned long DIFFEN : 1;
    unsigned long DMOF : 1;
    unsigned long Res1 : 6;
    unsigned long INTDELAY0 : 4;
    unsigned long INTDELAY1 : 4;
    unsigned long INTDELAY2 : 4;
    unsigned long INTDELAY3 : 4;
} sM2L31_EADC_EADC_CTL;

typedef union {
    sM2L31_EADC_EADC_CTL Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_CTL;

#define M2L31_EADC_EADC_SWTRG_RESET_VALUE 0x00000000
typedef struct {
    unsigned long SWTRG0 : 1;
    unsigned long SWTRG1 : 1;
    unsigned long SWTRG2 : 1;
    unsigned long SWTRG3 : 1;
    unsigned long SWTRG4 : 1;
    unsigned long SWTRG5 : 1;
    unsigned long SWTRG6 : 1;
    unsigned long SWTRG7 : 1;
    unsigned long SWTRG8 : 1;
    unsigned long SWTRG9 : 1;
    unsigned long SWTRG10 : 1;
    unsigned long SWTRG11 : 1;
    unsigned long SWTRG12 : 1;
    unsigned long SWTRG13 : 1;
    unsigned long SWTRG14 : 1;
    unsigned long SWTRG15 : 1;
    unsigned long SWTRG16 : 1;
    unsigned long SWTRG17 : 1;
    unsigned long SWTRG18 : 1;
    unsigned long SWTRG19 : 1;
    unsigned long SWTRG20 : 1;
    unsigned long SWTRG21 : 1;
    unsigned long SWTRG22 : 1;
    unsigned long SWTRG23 : 1;
    unsigned long SWTRG24 : 1;
    unsigned long SWTRG25 : 1;
    unsigned long SWTRG26 : 1;
    unsigned long SWTRG27 : 1;
    unsigned long SWTRG28 : 1;
    unsigned long SWTRG29 : 1;
    unsigned long SWTRG30 : 1;
    unsigned long Res0 : 1;
} sM2L31_EADC_EADC_SWTRG;

typedef union {
    sM2L31_EADC_EADC_SWTRG Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_SWTRG;

#define M2L31_EADC_EADC_PENDSTS_RESET_VALUE 0x00000000
typedef struct {
    unsigned long STPF0 : 1;
    unsigned long STPF1 : 1;
    unsigned long STPF2 : 1;
    unsigned long STPF3 : 1;
    unsigned long STPF4 : 1;
    unsigned long STPF5 : 1;
    unsigned long STPF6 : 1;
    unsigned long STPF7 : 1;
    unsigned long STPF8 : 1;
    unsigned long STPF9 : 1;
    unsigned long STPF10 : 1;
    unsigned long STPF11 : 1;
    unsigned long STPF12 : 1;
    unsigned long STPF13 : 1;
    unsigned long STPF14 : 1;
    unsigned long STPF15 : 1;
    unsigned long STPF16 : 1;
    unsigned long STPF17 : 1;
    unsigned long STPF18 : 1;
    unsigned long STPF19 : 1;
    unsigned long STPF20 : 1;
    unsigned long STPF21 : 1;
    unsigned long STPF22 : 1;
    unsigned long STPF23 : 1;
    unsigned long STPF24 : 1;
    unsigned long STPF25 : 1;
    unsigned long STPF26 : 1;
    unsigned long STPF27 : 1;
    unsigned long STPF28 : 1;
    unsigned long STPF29 : 1;
    unsigned long STPF30 : 1;
    unsigned long Res0 : 1;
} sM2L31_EADC_EADC_PENDSTS;

typedef union {
    sM2L31_EADC_EADC_PENDSTS Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_PENDSTS;

#define M2L31_EADC_EADC_OVSTS_RESET_VALUE 0x00000000
typedef struct {
    unsigned long SPOVF : 31;
    unsigned long Res0 : 1;
} sM2L31_EADC_EADC_OVSTS;

typedef union {
    sM2L31_EADC_EADC_OVSTS Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_OVSTS;

#define M2L31_EADC_EADC_CTL1_RESET_VALUE 0x00000000
typedef struct {
    unsigned long PRECHEN : 1;
    unsigned long DISCHEN : 1;
    unsigned long Res0 : 2;
    unsigned long RESSEL : 2;
    unsigned long Res1 : 2;
    unsigned long FDETCHEN : 1;
    unsigned long Res2 : 11;
    unsigned long CMP0TRG : 1;
    unsigned long CMP1TRG : 1;
    unsigned long CMP2TRG : 1;
    unsigned long CMP3TRG : 1;
    unsigned long Res3 : 8;
} sM2L31_EADC_EADC_CTL1;

typedef union {
    sM2L31_EADC_EADC_CTL1 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_CTL1;

#define M2L31_EADC_EADC_SCTL0_RESET_VALUE 0x00000014
typedef struct {
    unsigned long CHSEL : 5;
    unsigned long INTPOS : 1;
    unsigned long TRGDLYDIV : 2;
    unsigned long TRGDLYCNT : 8;
    unsigned long TRGSEL : 6;
    unsigned long EXTREN : 1;
    unsigned long EXTFEN : 1;
    unsigned long EXTSMPT : 8;
} sM2L31_EADC_EADC_SCTL0;

typedef union {
    sM2L31_EADC_EADC_SCTL0 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_SCTL0;

#define M2L31_EADC_EADC_SCTL1_RESET_VALUE 0x00000014
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_SCTL1;

typedef union {
    sM2L31_EADC_EADC_SCTL1 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_SCTL1;

#define M2L31_EADC_EADC_SCTL2_RESET_VALUE 0x00000014
typedef struct {
    unsigned long CHSEL : 5;
    unsigned long INTPOS : 1;
    unsigned long TRGDLYDIV : 2;
    unsigned long TRGDLYCNT : 8;
    unsigned long TRGSEL : 6;
    unsigned long EXTREN : 1;
    unsigned long EXTFEN : 1;
    unsigned long EXTSMPT : 8;
} sM2L31_EADC_EADC_SCTL2;

typedef union {
    sM2L31_EADC_EADC_SCTL2 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_SCTL2;

#define M2L31_EADC_EADC_SCTL3_RESET_VALUE 0x00000014
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_SCTL3;

typedef union {
    sM2L31_EADC_EADC_SCTL3 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_SCTL3;

#define M2L31_EADC_EADC_SCTL4_RESET_VALUE 0x00000014
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_SCTL4;

typedef union {
    sM2L31_EADC_EADC_SCTL4 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_SCTL4;

#define M2L31_EADC_EADC_SCTL5_RESET_VALUE 0x00000014
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_SCTL5;

typedef union {
    sM2L31_EADC_EADC_SCTL5 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_SCTL5;

#define M2L31_EADC_EADC_SCTL6_RESET_VALUE 0x00000014
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_SCTL6;

typedef union {
    sM2L31_EADC_EADC_SCTL6 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_SCTL6;

#define M2L31_EADC_EADC_SCTL7_RESET_VALUE 0x00000014
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_SCTL7;

typedef union {
    sM2L31_EADC_EADC_SCTL7 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_SCTL7;

#define M2L31_EADC_EADC_SCTL8_RESET_VALUE 0x00000014
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_SCTL8;

typedef union {
    sM2L31_EADC_EADC_SCTL8 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_SCTL8;

#define M2L31_EADC_EADC_SCTL9_RESET_VALUE 0x00000014
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_SCTL9;

typedef union {
    sM2L31_EADC_EADC_SCTL9 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_SCTL9;

#define M2L31_EADC_EADC_SCTL10_RESET_VALUE 0x00000014
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_SCTL10;

typedef union {
    sM2L31_EADC_EADC_SCTL10 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_SCTL10;

#define M2L31_EADC_EADC_SCTL11_RESET_VALUE 0x00000014
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_SCTL11;

typedef union {
    sM2L31_EADC_EADC_SCTL11 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_SCTL11;

#define M2L31_EADC_EADC_SCTL12_RESET_VALUE 0x00000014
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_SCTL12;

typedef union {
    sM2L31_EADC_EADC_SCTL12 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_SCTL12;

#define M2L31_EADC_EADC_SCTL13_RESET_VALUE 0x00000014
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_SCTL13;

typedef union {
    sM2L31_EADC_EADC_SCTL13 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_SCTL13;

#define M2L31_EADC_EADC_SCTL14_RESET_VALUE 0x00000014
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_SCTL14;

typedef union {
    sM2L31_EADC_EADC_SCTL14 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_SCTL14;

#define M2L31_EADC_EADC_SCTL15_RESET_VALUE 0x00000014
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_SCTL15;

typedef union {
    sM2L31_EADC_EADC_SCTL15 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_SCTL15;

#define M2L31_EADC_EADC_SCTL16_RESET_VALUE 0x00000014
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_SCTL16;

typedef union {
    sM2L31_EADC_EADC_SCTL16 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_SCTL16;

#define M2L31_EADC_EADC_SCTL17_RESET_VALUE 0x00000014
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_SCTL17;

typedef union {
    sM2L31_EADC_EADC_SCTL17 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_SCTL17;

#define M2L31_EADC_EADC_SCTL18_RESET_VALUE 0x00000014
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_SCTL18;

typedef union {
    sM2L31_EADC_EADC_SCTL18 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_SCTL18;

#define M2L31_EADC_EADC_INTSRC0_RESET_VALUE 0x00000000
typedef struct {
    unsigned long SPLIE0 : 1;
    unsigned long SPLIE1 : 1;
    unsigned long SPLIE2 : 1;
    unsigned long SPLIE3 : 1;
    unsigned long SPLIE4 : 1;
    unsigned long SPLIE5 : 1;
    unsigned long SPLIE6 : 1;
    unsigned long SPLIE7 : 1;
    unsigned long SPLIE8 : 1;
    unsigned long SPLIE9 : 1;
    unsigned long SPLIE10 : 1;
    unsigned long SPLIE11 : 1;
    unsigned long SPLIE12 : 1;
    unsigned long SPLIE13 : 1;
    unsigned long SPLIE14 : 1;
    unsigned long SPLIE15 : 1;
    unsigned long SPLIE16 : 1;
    unsigned long SPLIE17 : 1;
    unsigned long SPLIE18 : 1;
    unsigned long SPLIE19 : 1;
    unsigned long SPLIE20 : 1;
    unsigned long SPLIE21 : 1;
    unsigned long SPLIE22 : 1;
    unsigned long SPLIE23 : 1;
    unsigned long SPLIE24 : 1;
    unsigned long SPLIE25 : 1;
    unsigned long SPLIE26 : 1;
    unsigned long SPLIE27 : 1;
    unsigned long SPLIE28 : 1;
    unsigned long SPLIE29 : 1;
    unsigned long SPLIE30 : 1;
    unsigned long Res0 : 1;
} sM2L31_EADC_EADC_INTSRC0;

typedef union {
    sM2L31_EADC_EADC_INTSRC0 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_INTSRC0;

#define M2L31_EADC_EADC_INTSRC1_RESET_VALUE 0x00000000
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_INTSRC1;

typedef union {
    sM2L31_EADC_EADC_INTSRC1 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_INTSRC1;

#define M2L31_EADC_EADC_INTSRC2_RESET_VALUE 0x00000000
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_INTSRC2;

typedef union {
    sM2L31_EADC_EADC_INTSRC2 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_INTSRC2;

#define M2L31_EADC_EADC_INTSRC3_RESET_VALUE 0x00000000
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_INTSRC3;

typedef union {
    sM2L31_EADC_EADC_INTSRC3 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_INTSRC3;

#define M2L31_EADC_EADC_CMP0_RESET_VALUE 0x00000000
typedef struct {
    unsigned long ADCMPEN : 1;
    unsigned long ADCMPIE : 1;
    unsigned long CMPCOND : 1;
    unsigned long CMPSPL : 5;
    unsigned long CMPMCNT : 4;
    unsigned long Res0 : 3;
    unsigned long CMPWEN : 1;
    unsigned long CMPDAT : 12;
    unsigned long Res1 : 4;
} sM2L31_EADC_EADC_CMP0;

typedef union {
    sM2L31_EADC_EADC_CMP0 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_CMP0;

#define M2L31_EADC_EADC_CMP1_RESET_VALUE 0x00000000
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_CMP1;

typedef union {
    sM2L31_EADC_EADC_CMP1 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_CMP1;

#define M2L31_EADC_EADC_CMP2_RESET_VALUE 0x00000000
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_CMP2;

typedef union {
    sM2L31_EADC_EADC_CMP2 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_CMP2;

#define M2L31_EADC_EADC_CMP3_RESET_VALUE 0x00000000
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_CMP3;

typedef union {
    sM2L31_EADC_EADC_CMP3 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_CMP3;

#define M2L31_EADC_EADC_STATUS0_RESET_VALUE 0x00000000
typedef struct {
    unsigned long VALID : 16;
    unsigned long OV : 16;
} sM2L31_EADC_EADC_STATUS0;

typedef union {
    sM2L31_EADC_EADC_STATUS0 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_STATUS0;

#define M2L31_EADC_EADC_STATUS1_RESET_VALUE 0x00000000
typedef struct {
    unsigned long VALID : 15;
    unsigned long Res0 : 1;
    unsigned long OV : 15;
    unsigned long Res1 : 1;
} sM2L31_EADC_EADC_STATUS1;

typedef union {
    sM2L31_EADC_EADC_STATUS1 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_STATUS1;

#define M2L31_EADC_EADC_STATUS2_RESET_VALUE 0x001B0000
typedef struct {
    unsigned long ADIF0 : 1;
    unsigned long ADIF1 : 1;
    unsigned long ADIF2 : 1;
    unsigned long ADIF3 : 1;
    unsigned long ADCMPF0 : 1;
    unsigned long ADCMPF1 : 1;
    unsigned long ADCMPF2 : 1;
    unsigned long ADCMPF3 : 1;
    unsigned long ADOVIF0 : 1;
    unsigned long ADOVIF1 : 1;
    unsigned long ADOVIF2 : 1;
    unsigned long ADOVIF3 : 1;
    unsigned long ADCMPO0 : 1;
    unsigned long ADCMPO1 : 1;
    unsigned long ADCMPO2 : 1;
    unsigned long ADCMPO3 : 1;
    unsigned long CHANNEL : 5;
    unsigned long Res0 : 2;
    unsigned long BUSY : 1;
    unsigned long ADOVIF : 1;
    unsigned long STOVF : 1;
    unsigned long AVALID : 1;
    unsigned long AOV : 1;
    unsigned long Res1 : 4;
} sM2L31_EADC_EADC_STATUS2;

typedef union {
    sM2L31_EADC_EADC_STATUS2 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_STATUS2;

#define M2L31_EADC_EADC_STATUS3_RESET_VALUE 0x0000001F
typedef struct {
    unsigned long CURSPL : 5;
    unsigned long Res0 : 27;
} sM2L31_EADC_EADC_STATUS3;

typedef union {
    sM2L31_EADC_EADC_STATUS3 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_STATUS3;

#define M2L31_EADC_EADC_DDAT0_RESET_VALUE 0x00000000
typedef struct {
    unsigned long RESULT : 16;
    unsigned long OV : 1;
    unsigned long VALID : 1;
    unsigned long Res0 : 14;
} sM2L31_EADC_EADC_DDAT0;

typedef union {
    sM2L31_EADC_EADC_DDAT0 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_DDAT0;

#define M2L31_EADC_EADC_DDAT1_RESET_VALUE 0x00000000
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_DDAT1;

typedef union {
    sM2L31_EADC_EADC_DDAT1 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_DDAT1;

#define M2L31_EADC_EADC_DDAT2_RESET_VALUE 0x00000000
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_DDAT2;

typedef union {
    sM2L31_EADC_EADC_DDAT2 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_DDAT2;

#define M2L31_EADC_EADC_DDAT3_RESET_VALUE 0x00000000
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_DDAT3;

typedef union {
    sM2L31_EADC_EADC_DDAT3 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_DDAT3;

#define M2L31_EADC_EADC_CALCTL_RESET_VALUE 0x00000020
typedef struct {
    unsigned long CAL : 1;
    unsigned long CALIE : 1;
    unsigned long Res0 : 30;
} sM2L31_EADC_EADC_CALCTL;

typedef union {
    sM2L31_EADC_EADC_CALCTL Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_CALCTL;

#define M2L31_EADC_EADC_CALSR_RESET_VALUE 0x00000000
typedef struct {
    unsigned long Res0 : 16;
    unsigned long CALIF : 1;
    unsigned long Res1 : 15;
} sM2L31_EADC_EADC_CALSR;

typedef union {
    sM2L31_EADC_EADC_CALSR Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_CALSR;

#define M2L31_EADC_EADC_PDMACTL_RESET_VALUE 0x00000000
typedef struct {
    unsigned long PDMATEN : 31;
    unsigned long Res0 : 1;
} sM2L31_EADC_EADC_PDMACTL;

typedef union {
    sM2L31_EADC_EADC_PDMACTL Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_PDMACTL;

#define M2L31_EADC_EADC_M0CTL1_RESET_VALUE 0x00000000
typedef struct {
    unsigned long ALIGN : 1;
    unsigned long AVG : 1;
    unsigned long Res0 : 2;
    unsigned long ACU : 4;
    unsigned long Res1 : 8;
    unsigned long EXTSTDIV : 2;
    unsigned long Res2 : 2;
    unsigned long DBMEN : 1;
    unsigned long Res3 : 11;
} sM2L31_EADC_EADC_M0CTL1;

typedef union {
    sM2L31_EADC_EADC_M0CTL1 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_M0CTL1;

#define M2L31_EADC_EADC_M1CTL1_RESET_VALUE 0x00000000
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_M1CTL1;

typedef union {
    sM2L31_EADC_EADC_M1CTL1 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_M1CTL1;

#define M2L31_EADC_EADC_M2CTL1_RESET_VALUE 0x00000000
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_M2CTL1;

typedef union {
    sM2L31_EADC_EADC_M2CTL1 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_M2CTL1;

#define M2L31_EADC_EADC_M3CTL1_RESET_VALUE 0x00000000
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_M3CTL1;

typedef union {
    sM2L31_EADC_EADC_M3CTL1 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_M3CTL1;

#define M2L31_EADC_EADC_M4CTL1_RESET_VALUE 0x00000000
typedef struct {
    unsigned long ALIGN : 1;
    unsigned long AVG : 1;
    unsigned long Res0 : 2;
    unsigned long ACU : 4;
    unsigned long Res1 : 8;
    unsigned long EXTSTDIV : 2;
    unsigned long Res2 : 14;
} sM2L31_EADC_EADC_M4CTL1;

typedef union {
    sM2L31_EADC_EADC_M4CTL1 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_M4CTL1;

#define M2L31_EADC_EADC_M5CTL1_RESET_VALUE 0x00000000
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_M5CTL1;

typedef union {
    sM2L31_EADC_EADC_M5CTL1 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_M5CTL1;

#define M2L31_EADC_EADC_M6CTL1_RESET_VALUE 0x00000000
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_M6CTL1;

typedef union {
    sM2L31_EADC_EADC_M6CTL1 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_M6CTL1;

#define M2L31_EADC_EADC_M7CTL1_RESET_VALUE 0x00000000
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_M7CTL1;

typedef union {
    sM2L31_EADC_EADC_M7CTL1 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_M7CTL1;

#define M2L31_EADC_EADC_M8CTL1_RESET_VALUE 0x00000000
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_M8CTL1;

typedef union {
    sM2L31_EADC_EADC_M8CTL1 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_M8CTL1;

#define M2L31_EADC_EADC_M9CTL1_RESET_VALUE 0x00000000
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_M9CTL1;

typedef union {
    sM2L31_EADC_EADC_M9CTL1 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_M9CTL1;

#define M2L31_EADC_EADC_M10CTL1_RESET_VALUE 0x00000000
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_M10CTL1;

typedef union {
    sM2L31_EADC_EADC_M10CTL1 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_M10CTL1;

#define M2L31_EADC_EADC_M11CTL1_RESET_VALUE 0x00000000
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_M11CTL1;

typedef union {
    sM2L31_EADC_EADC_M11CTL1 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_M11CTL1;

#define M2L31_EADC_EADC_M12CTL1_RESET_VALUE 0x00000000
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_M12CTL1;

typedef union {
    sM2L31_EADC_EADC_M12CTL1 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_M12CTL1;

#define M2L31_EADC_EADC_M13CTL1_RESET_VALUE 0x00000000
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_M13CTL1;

typedef union {
    sM2L31_EADC_EADC_M13CTL1 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_M13CTL1;

#define M2L31_EADC_EADC_M14CTL1_RESET_VALUE 0x00000000
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_M14CTL1;

typedef union {
    sM2L31_EADC_EADC_M14CTL1 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_M14CTL1;

#define M2L31_EADC_EADC_M15CTL1_RESET_VALUE 0x00000000
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_M15CTL1;

typedef union {
    sM2L31_EADC_EADC_M15CTL1 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_M15CTL1;

#define M2L31_EADC_EADC_M16CTL1_RESET_VALUE 0x00000000
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_M16CTL1;

typedef union {
    sM2L31_EADC_EADC_M16CTL1 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_M16CTL1;

#define M2L31_EADC_EADC_M17CTL1_RESET_VALUE 0x00000000
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_M17CTL1;

typedef union {
    sM2L31_EADC_EADC_M17CTL1 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_M17CTL1;

#define M2L31_EADC_EADC_M18CTL1_RESET_VALUE 0x00000000
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_M18CTL1;

typedef union {
    sM2L31_EADC_EADC_M18CTL1 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_M18CTL1;

#define M2L31_EADC_EADC_DAT19_RESET_VALUE 0x00000000
typedef struct {
    unsigned long RESULT : 16;
    unsigned long OV : 1;
    unsigned long VALID : 1;
    unsigned long Res0 : 14;
} sM2L31_EADC_EADC_DAT19;

typedef union {
    sM2L31_EADC_EADC_DAT19 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_DAT19;

#define M2L31_EADC_EADC_DAT20_RESET_VALUE 0x00000000
typedef struct {
    unsigned long RESULT : 16;
    unsigned long OV : 1;
    unsigned long VALID : 1;
    unsigned long Res0 : 14;
} sM2L31_EADC_EADC_DAT20;

typedef union {
    sM2L31_EADC_EADC_DAT20 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_DAT20;

#define M2L31_EADC_EADC_DAT21_RESET_VALUE 0x00000000
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_DAT21;

typedef union {
    sM2L31_EADC_EADC_DAT21 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_DAT21;

#define M2L31_EADC_EADC_DAT22_RESET_VALUE 0x00000000
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_DAT22;

typedef union {
    sM2L31_EADC_EADC_DAT22 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_DAT22;

#define M2L31_EADC_EADC_DAT23_RESET_VALUE 0x00000000
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_DAT23;

typedef union {
    sM2L31_EADC_EADC_DAT23 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_DAT23;

#define M2L31_EADC_EADC_DAT24_RESET_VALUE 0x00000000
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_DAT24;

typedef union {
    sM2L31_EADC_EADC_DAT24 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_DAT24;

#define M2L31_EADC_EADC_DAT25_RESET_VALUE 0x00000000
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_DAT25;

typedef union {
    sM2L31_EADC_EADC_DAT25 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_DAT25;

#define M2L31_EADC_EADC_DAT26_RESET_VALUE 0x00000000
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_DAT26;

typedef union {
    sM2L31_EADC_EADC_DAT26 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_DAT26;

#define M2L31_EADC_EADC_DAT27_RESET_VALUE 0x00000000
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_DAT27;

typedef union {
    sM2L31_EADC_EADC_DAT27 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_DAT27;

#define M2L31_EADC_EADC_DAT28_RESET_VALUE 0x00000000
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_DAT28;

typedef union {
    sM2L31_EADC_EADC_DAT28 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_DAT28;

#define M2L31_EADC_EADC_DAT29_RESET_VALUE 0x00000000
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_DAT29;

typedef union {
    sM2L31_EADC_EADC_DAT29 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_DAT29;

#define M2L31_EADC_EADC_DAT30_RESET_VALUE 0x00000000
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_DAT30;

typedef union {
    sM2L31_EADC_EADC_DAT30 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_DAT30;

#define M2L31_EADC_EADC_SCTL19_RESET_VALUE 0x00000014
typedef struct {
    unsigned long CHSEL : 5;
    unsigned long INTPOS : 1;
    unsigned long TRGDLYDIV : 2;
    unsigned long TRGDLYCNT : 8;
    unsigned long TRGSEL : 6;
    unsigned long EXTREN : 1;
    unsigned long EXTFEN : 1;
    unsigned long EXTSMPT : 8;
} sM2L31_EADC_EADC_SCTL19;

typedef union {
    sM2L31_EADC_EADC_SCTL19 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_SCTL19;

#define M2L31_EADC_EADC_SCTL20_RESET_VALUE 0x00000014
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_SCTL20;

typedef union {
    sM2L31_EADC_EADC_SCTL20 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_SCTL20;

#define M2L31_EADC_EADC_SCTL21_RESET_VALUE 0x00000014
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_SCTL21;

typedef union {
    sM2L31_EADC_EADC_SCTL21 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_SCTL21;

#define M2L31_EADC_EADC_SCTL22_RESET_VALUE 0x00000014
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_SCTL22;

typedef union {
    sM2L31_EADC_EADC_SCTL22 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_SCTL22;

#define M2L31_EADC_EADC_SCTL23_RESET_VALUE 0x00000014
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_SCTL23;

typedef union {
    sM2L31_EADC_EADC_SCTL23 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_SCTL23;

#define M2L31_EADC_EADC_SCTL24_RESET_VALUE 0x00000014
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_SCTL24;

typedef union {
    sM2L31_EADC_EADC_SCTL24 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_SCTL24;

#define M2L31_EADC_EADC_SCTL25_RESET_VALUE 0x00000014
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_SCTL25;

typedef union {
    sM2L31_EADC_EADC_SCTL25 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_SCTL25;

#define M2L31_EADC_EADC_SCTL26_RESET_VALUE 0x00000014
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_SCTL26;

typedef union {
    sM2L31_EADC_EADC_SCTL26 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_SCTL26;

#define M2L31_EADC_EADC_SCTL27_RESET_VALUE 0x00000000
typedef struct {
    unsigned long Res0 : 24;
    unsigned long EXTSMPT : 8;
} sM2L31_EADC_EADC_SCTL27;

typedef union {
    sM2L31_EADC_EADC_SCTL27 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_SCTL27;

#define M2L31_EADC_EADC_SCTL28_RESET_VALUE 0x00000000
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_SCTL28;

typedef union {
    sM2L31_EADC_EADC_SCTL28 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_SCTL28;

#define M2L31_EADC_EADC_SCTL29_RESET_VALUE 0x00000000
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_SCTL29;

typedef union {
    sM2L31_EADC_EADC_SCTL29 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_SCTL29;

#define M2L31_EADC_EADC_SCTL30_RESET_VALUE 0x00000000
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_SCTL30;

typedef union {
    sM2L31_EADC_EADC_SCTL30 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_SCTL30;

#define M2L31_EADC_EADC_M19CTL1_RESET_VALUE 0x00000000
typedef struct {
    unsigned long ALIGN : 1;
    unsigned long AVG : 1;
    unsigned long Res0 : 2;
    unsigned long ACU : 4;
    unsigned long Res1 : 8;
    unsigned long EXTSTDIV : 2;
    unsigned long Res2 : 14;
} sM2L31_EADC_EADC_M19CTL1;

typedef union {
    sM2L31_EADC_EADC_M19CTL1 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_M19CTL1;

#define M2L31_EADC_EADC_M20CTL1_RESET_VALUE 0x00000000
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_M20CTL1;

typedef union {
    sM2L31_EADC_EADC_M20CTL1 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_M20CTL1;

#define M2L31_EADC_EADC_M21CTL1_RESET_VALUE 0x00000000
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_M21CTL1;

typedef union {
    sM2L31_EADC_EADC_M21CTL1 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_M21CTL1;

#define M2L31_EADC_EADC_M22CTL1_RESET_VALUE 0x00000000
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_M22CTL1;

typedef union {
    sM2L31_EADC_EADC_M22CTL1 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_M22CTL1;

#define M2L31_EADC_EADC_M23CTL1_RESET_VALUE 0x00000000
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_M23CTL1;

typedef union {
    sM2L31_EADC_EADC_M23CTL1 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_M23CTL1;

#define M2L31_EADC_EADC_M24CTL1_RESET_VALUE 0x00000000
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_M24CTL1;

typedef union {
    sM2L31_EADC_EADC_M24CTL1 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_M24CTL1;

#define M2L31_EADC_EADC_M25CTL1_RESET_VALUE 0x00000000
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_M25CTL1;

typedef union {
    sM2L31_EADC_EADC_M25CTL1 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_M25CTL1;

#define M2L31_EADC_EADC_M26CTL1_RESET_VALUE 0x00000000
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_M26CTL1;

typedef union {
    sM2L31_EADC_EADC_M26CTL1 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_M26CTL1;

#define M2L31_EADC_EADC_M27CTL1_RESET_VALUE 0x00000000
typedef struct {
    unsigned long Res0 : 16;
    unsigned long EXTSTDIV : 2;
    unsigned long Res1 : 14;
} sM2L31_EADC_EADC_M27CTL1;

typedef union {
    sM2L31_EADC_EADC_M27CTL1 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_M27CTL1;

#define M2L31_EADC_EADC_M28CTL1_RESET_VALUE 0x00000000
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_M28CTL1;

typedef union {
    sM2L31_EADC_EADC_M28CTL1 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_M28CTL1;

#define M2L31_EADC_EADC_M29CTL1_RESET_VALUE 0x00000000
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_M29CTL1;

typedef union {
    sM2L31_EADC_EADC_M29CTL1 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_M29CTL1;

#define M2L31_EADC_EADC_M30CTL1_RESET_VALUE 0x00000000
typedef struct {
    unsigned long Res0 : 32;
} sM2L31_EADC_EADC_M30CTL1;

typedef union {
    sM2L31_EADC_EADC_M30CTL1 Bit;
    unsigned long  All;
} uM2L31_EADC_EADC_M30CTL1;

typedef struct {
    uM2L31_EADC_EADC_DAT0 M2L31_EADC_EADC_DAT0; // Offset: 0x0
    uM2L31_EADC_EADC_DAT1 M2L31_EADC_EADC_DAT1; // Offset: 0x4
    uM2L31_EADC_EADC_DAT2 M2L31_EADC_EADC_DAT2; // Offset: 0x8
    uM2L31_EADC_EADC_DAT3 M2L31_EADC_EADC_DAT3; // Offset: 0xc
    uM2L31_EADC_EADC_DAT4 M2L31_EADC_EADC_DAT4; // Offset: 0x10
    uM2L31_EADC_EADC_DAT5 M2L31_EADC_EADC_DAT5; // Offset: 0x14
    uM2L31_EADC_EADC_DAT6 M2L31_EADC_EADC_DAT6; // Offset: 0x18
    uM2L31_EADC_EADC_DAT7 M2L31_EADC_EADC_DAT7; // Offset: 0x1c
    uM2L31_EADC_EADC_DAT8 M2L31_EADC_EADC_DAT8; // Offset: 0x20
    uM2L31_EADC_EADC_DAT9 M2L31_EADC_EADC_DAT9; // Offset: 0x24
    uM2L31_EADC_EADC_DAT10 M2L31_EADC_EADC_DAT10; // Offset: 0x28
    uM2L31_EADC_EADC_DAT11 M2L31_EADC_EADC_DAT11; // Offset: 0x2c
    uM2L31_EADC_EADC_DAT12 M2L31_EADC_EADC_DAT12; // Offset: 0x30
    uM2L31_EADC_EADC_DAT13 M2L31_EADC_EADC_DAT13; // Offset: 0x34
    uM2L31_EADC_EADC_DAT14 M2L31_EADC_EADC_DAT14; // Offset: 0x38
    uM2L31_EADC_EADC_DAT15 M2L31_EADC_EADC_DAT15; // Offset: 0x3c
    uM2L31_EADC_EADC_DAT16 M2L31_EADC_EADC_DAT16; // Offset: 0x40
    uM2L31_EADC_EADC_DAT17 M2L31_EADC_EADC_DAT17; // Offset: 0x44
    uM2L31_EADC_EADC_DAT18 M2L31_EADC_EADC_DAT18; // Offset: 0x48
    uM2L31_EADC_EADC_CURDAT M2L31_EADC_EADC_CURDAT; // Offset: 0x4c
    uM2L31_EADC_EADC_CTL M2L31_EADC_EADC_CTL; // Offset: 0x50
    uM2L31_EADC_EADC_SWTRG M2L31_EADC_EADC_SWTRG; // Offset: 0x54
    uM2L31_EADC_EADC_PENDSTS M2L31_EADC_EADC_PENDSTS; // Offset: 0x58
    uM2L31_EADC_EADC_OVSTS M2L31_EADC_EADC_OVSTS; // Offset: 0x5c
    uM2L31_EADC_EADC_CTL1 M2L31_EADC_EADC_CTL1; // Offset: 0x60
    unsigned long Reserved0;
    unsigned long Reserved1;
    unsigned long Reserved2;
    unsigned long Reserved3;
    unsigned long Reserved4;
    unsigned long Reserved5;
    unsigned long Reserved6;
    uM2L31_EADC_EADC_SCTL0 M2L31_EADC_EADC_SCTL0; // Offset: 0x80
    uM2L31_EADC_EADC_SCTL1 M2L31_EADC_EADC_SCTL1; // Offset: 0x84
    uM2L31_EADC_EADC_SCTL2 M2L31_EADC_EADC_SCTL2; // Offset: 0x88
    uM2L31_EADC_EADC_SCTL3 M2L31_EADC_EADC_SCTL3; // Offset: 0x8c
    uM2L31_EADC_EADC_SCTL4 M2L31_EADC_EADC_SCTL4; // Offset: 0x90
    uM2L31_EADC_EADC_SCTL5 M2L31_EADC_EADC_SCTL5; // Offset: 0x94
    uM2L31_EADC_EADC_SCTL6 M2L31_EADC_EADC_SCTL6; // Offset: 0x98
    uM2L31_EADC_EADC_SCTL7 M2L31_EADC_EADC_SCTL7; // Offset: 0x9c
    uM2L31_EADC_EADC_SCTL8 M2L31_EADC_EADC_SCTL8; // Offset: 0xa0
    uM2L31_EADC_EADC_SCTL9 M2L31_EADC_EADC_SCTL9; // Offset: 0xa4
    uM2L31_EADC_EADC_SCTL10 M2L31_EADC_EADC_SCTL10; // Offset: 0xa8
    uM2L31_EADC_EADC_SCTL11 M2L31_EADC_EADC_SCTL11; // Offset: 0xac
    uM2L31_EADC_EADC_SCTL12 M2L31_EADC_EADC_SCTL12; // Offset: 0xb0
    uM2L31_EADC_EADC_SCTL13 M2L31_EADC_EADC_SCTL13; // Offset: 0xb4
    uM2L31_EADC_EADC_SCTL14 M2L31_EADC_EADC_SCTL14; // Offset: 0xb8
    uM2L31_EADC_EADC_SCTL15 M2L31_EADC_EADC_SCTL15; // Offset: 0xbc
    uM2L31_EADC_EADC_SCTL16 M2L31_EADC_EADC_SCTL16; // Offset: 0xc0
    uM2L31_EADC_EADC_SCTL17 M2L31_EADC_EADC_SCTL17; // Offset: 0xc4
    uM2L31_EADC_EADC_SCTL18 M2L31_EADC_EADC_SCTL18; // Offset: 0xc8
    unsigned long Reserved7;
    uM2L31_EADC_EADC_INTSRC0 M2L31_EADC_EADC_INTSRC0; // Offset: 0xd0
    uM2L31_EADC_EADC_INTSRC1 M2L31_EADC_EADC_INTSRC1; // Offset: 0xd4
    uM2L31_EADC_EADC_INTSRC2 M2L31_EADC_EADC_INTSRC2; // Offset: 0xd8
    uM2L31_EADC_EADC_INTSRC3 M2L31_EADC_EADC_INTSRC3; // Offset: 0xdc
    uM2L31_EADC_EADC_CMP0 M2L31_EADC_EADC_CMP0; // Offset: 0xe0
    uM2L31_EADC_EADC_CMP1 M2L31_EADC_EADC_CMP1; // Offset: 0xe4
    uM2L31_EADC_EADC_CMP2 M2L31_EADC_EADC_CMP2; // Offset: 0xe8
    uM2L31_EADC_EADC_CMP3 M2L31_EADC_EADC_CMP3; // Offset: 0xec
    uM2L31_EADC_EADC_STATUS0 M2L31_EADC_EADC_STATUS0; // Offset: 0xf0
    uM2L31_EADC_EADC_STATUS1 M2L31_EADC_EADC_STATUS1; // Offset: 0xf4
    uM2L31_EADC_EADC_STATUS2 M2L31_EADC_EADC_STATUS2; // Offset: 0xf8
    uM2L31_EADC_EADC_STATUS3 M2L31_EADC_EADC_STATUS3; // Offset: 0xfc
    uM2L31_EADC_EADC_DDAT0 M2L31_EADC_EADC_DDAT0; // Offset: 0x100
    uM2L31_EADC_EADC_DDAT1 M2L31_EADC_EADC_DDAT1; // Offset: 0x104
    uM2L31_EADC_EADC_DDAT2 M2L31_EADC_EADC_DDAT2; // Offset: 0x108
    uM2L31_EADC_EADC_DDAT3 M2L31_EADC_EADC_DDAT3; // Offset: 0x10c
    unsigned long Reserved8;
    uM2L31_EADC_EADC_CALCTL M2L31_EADC_EADC_CALCTL; // Offset: 0x114
    uM2L31_EADC_EADC_CALSR M2L31_EADC_EADC_CALSR; // Offset: 0x118
    unsigned long Reserved9;
    unsigned long Reserved10;
    unsigned long Reserved11;
    unsigned long Reserved12;
    unsigned long Reserved13;
    uM2L31_EADC_EADC_PDMACTL M2L31_EADC_EADC_PDMACTL; // Offset: 0x130
    unsigned long Reserved14;
    unsigned long Reserved15;
    unsigned long Reserved16;
    uM2L31_EADC_EADC_M0CTL1 M2L31_EADC_EADC_M0CTL1; // Offset: 0x140
    uM2L31_EADC_EADC_M1CTL1 M2L31_EADC_EADC_M1CTL1; // Offset: 0x144
    uM2L31_EADC_EADC_M2CTL1 M2L31_EADC_EADC_M2CTL1; // Offset: 0x148
    uM2L31_EADC_EADC_M3CTL1 M2L31_EADC_EADC_M3CTL1; // Offset: 0x14c
    uM2L31_EADC_EADC_M4CTL1 M2L31_EADC_EADC_M4CTL1; // Offset: 0x150
    uM2L31_EADC_EADC_M5CTL1 M2L31_EADC_EADC_M5CTL1; // Offset: 0x154
    uM2L31_EADC_EADC_M6CTL1 M2L31_EADC_EADC_M6CTL1; // Offset: 0x158
    uM2L31_EADC_EADC_M7CTL1 M2L31_EADC_EADC_M7CTL1; // Offset: 0x15c
    uM2L31_EADC_EADC_M8CTL1 M2L31_EADC_EADC_M8CTL1; // Offset: 0x160
    uM2L31_EADC_EADC_M9CTL1 M2L31_EADC_EADC_M9CTL1; // Offset: 0x164
    uM2L31_EADC_EADC_M10CTL1 M2L31_EADC_EADC_M10CTL1; // Offset: 0x168
    uM2L31_EADC_EADC_M11CTL1 M2L31_EADC_EADC_M11CTL1; // Offset: 0x16c
    uM2L31_EADC_EADC_M12CTL1 M2L31_EADC_EADC_M12CTL1; // Offset: 0x170
    uM2L31_EADC_EADC_M13CTL1 M2L31_EADC_EADC_M13CTL1; // Offset: 0x174
    uM2L31_EADC_EADC_M14CTL1 M2L31_EADC_EADC_M14CTL1; // Offset: 0x178
    uM2L31_EADC_EADC_M15CTL1 M2L31_EADC_EADC_M15CTL1; // Offset: 0x17c
    uM2L31_EADC_EADC_M16CTL1 M2L31_EADC_EADC_M16CTL1; // Offset: 0x180
    uM2L31_EADC_EADC_M17CTL1 M2L31_EADC_EADC_M17CTL1; // Offset: 0x184
    uM2L31_EADC_EADC_M18CTL1 M2L31_EADC_EADC_M18CTL1; // Offset: 0x188
    unsigned long Reserved17;
    unsigned long Reserved18;
    unsigned long Reserved19;
    unsigned long Reserved20;
    unsigned long Reserved21;
    unsigned long Reserved22;
    unsigned long Reserved23;
    unsigned long Reserved24;
    unsigned long Reserved25;
    unsigned long Reserved26;
    unsigned long Reserved27;
    unsigned long Reserved28;
    unsigned long Reserved29;
    unsigned long Reserved30;
    unsigned long Reserved31;
    unsigned long Reserved32;
    unsigned long Reserved33;
    unsigned long Reserved34;
    unsigned long Reserved35;
    unsigned long Reserved36;
    unsigned long Reserved37;
    unsigned long Reserved38;
    unsigned long Reserved39;
    unsigned long Reserved40;
    unsigned long Reserved41;
    unsigned long Reserved42;
    unsigned long Reserved43;
    unsigned long Reserved44;
    unsigned long Reserved45;
    uM2L31_EADC_EADC_DAT19 M2L31_EADC_EADC_DAT19; // Offset: 0x200
    uM2L31_EADC_EADC_DAT20 M2L31_EADC_EADC_DAT20; // Offset: 0x204
    uM2L31_EADC_EADC_DAT21 M2L31_EADC_EADC_DAT21; // Offset: 0x208
    uM2L31_EADC_EADC_DAT22 M2L31_EADC_EADC_DAT22; // Offset: 0x20c
    uM2L31_EADC_EADC_DAT23 M2L31_EADC_EADC_DAT23; // Offset: 0x210
    uM2L31_EADC_EADC_DAT24 M2L31_EADC_EADC_DAT24; // Offset: 0x214
    uM2L31_EADC_EADC_DAT25 M2L31_EADC_EADC_DAT25; // Offset: 0x218
    uM2L31_EADC_EADC_DAT26 M2L31_EADC_EADC_DAT26; // Offset: 0x21c
    uM2L31_EADC_EADC_DAT27 M2L31_EADC_EADC_DAT27; // Offset: 0x220
    uM2L31_EADC_EADC_DAT28 M2L31_EADC_EADC_DAT28; // Offset: 0x224
    uM2L31_EADC_EADC_DAT29 M2L31_EADC_EADC_DAT29; // Offset: 0x228
    uM2L31_EADC_EADC_DAT30 M2L31_EADC_EADC_DAT30; // Offset: 0x22c
    uM2L31_EADC_EADC_SCTL19 M2L31_EADC_EADC_SCTL19; // Offset: 0x230
    uM2L31_EADC_EADC_SCTL20 M2L31_EADC_EADC_SCTL20; // Offset: 0x234
    uM2L31_EADC_EADC_SCTL21 M2L31_EADC_EADC_SCTL21; // Offset: 0x238
    uM2L31_EADC_EADC_SCTL22 M2L31_EADC_EADC_SCTL22; // Offset: 0x23c
    uM2L31_EADC_EADC_SCTL23 M2L31_EADC_EADC_SCTL23; // Offset: 0x240
    uM2L31_EADC_EADC_SCTL24 M2L31_EADC_EADC_SCTL24; // Offset: 0x244
    uM2L31_EADC_EADC_SCTL25 M2L31_EADC_EADC_SCTL25; // Offset: 0x248
    uM2L31_EADC_EADC_SCTL26 M2L31_EADC_EADC_SCTL26; // Offset: 0x24c
    uM2L31_EADC_EADC_SCTL27 M2L31_EADC_EADC_SCTL27; // Offset: 0x250
    uM2L31_EADC_EADC_SCTL28 M2L31_EADC_EADC_SCTL28; // Offset: 0x254
    uM2L31_EADC_EADC_SCTL29 M2L31_EADC_EADC_SCTL29; // Offset: 0x258
    uM2L31_EADC_EADC_SCTL30 M2L31_EADC_EADC_SCTL30; // Offset: 0x25c
    uM2L31_EADC_EADC_M19CTL1 M2L31_EADC_EADC_M19CTL1; // Offset: 0x260
    uM2L31_EADC_EADC_M20CTL1 M2L31_EADC_EADC_M20CTL1; // Offset: 0x264
    uM2L31_EADC_EADC_M21CTL1 M2L31_EADC_EADC_M21CTL1; // Offset: 0x268
    uM2L31_EADC_EADC_M22CTL1 M2L31_EADC_EADC_M22CTL1; // Offset: 0x26c
    uM2L31_EADC_EADC_M23CTL1 M2L31_EADC_EADC_M23CTL1; // Offset: 0x270
    uM2L31_EADC_EADC_M24CTL1 M2L31_EADC_EADC_M24CTL1; // Offset: 0x274
    uM2L31_EADC_EADC_M25CTL1 M2L31_EADC_EADC_M25CTL1; // Offset: 0x278
    uM2L31_EADC_EADC_M26CTL1 M2L31_EADC_EADC_M26CTL1; // Offset: 0x27c
    uM2L31_EADC_EADC_M27CTL1 M2L31_EADC_EADC_M27CTL1; // Offset: 0x280
    uM2L31_EADC_EADC_M28CTL1 M2L31_EADC_EADC_M28CTL1; // Offset: 0x284
    uM2L31_EADC_EADC_M29CTL1 M2L31_EADC_EADC_M29CTL1; // Offset: 0x288
    uM2L31_EADC_EADC_M30CTL1 M2L31_EADC_EADC_M30CTL1; // Offset: 0x28c
} sM2L31_EADC;

